#coding=utf-8
import sys
reload(sys)
sys.setdefaultencoding('utf8')

a=[[u'222.73.110.173:443:https', u'222.73.110.173:80:http'], [], [], []]
b=[[u'222.73.112.7:443:https'], [], [], []]
c=[[u'222.73.110.138:80:http', u'222.73.112.7:443:https', u'222.73.110.138:443:https'], [u'222.73.110.138:443:https', u'222.73.110.138:80:http'], [], []]
d=[[u'222.73.110.138:443:https', u'222.73.110.138:80:http', u'222.73.110.146:443:https', u'222.73.112.7:443:https', u'222.73.110.146:80:http', u'222.73.110.188:80:http', u'222.73.110.188:443:https'], [u'222.73.110.146:80:http', u'222.73.110.146:443:https', u'222.73.110.188:80:http', u'222.73.110.188:443:https'], [], []]
zhegeshizifu='open\nip               端口  网络协议\n'
for i in d[0]:
    # print i
    zhegeshizifu+=i.replace(':','   ')
    zhegeshizifu+='\n'
print zhegeshizifu

'''
有问题的ip：
222.73.110.142
没问题的ip：
222.73.112.7
222.73.110.138
222.73.110.137
222.73.112.12
'''
